Revit 2025 API
ViewDrafting.Create Method
 Creates a new ViewDrafting in the model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public static ViewDrafting Create(
	Document document,
	ElementId viewFamilyTypeId
)
Public Shared Function Create (
	document As Document,
	viewFamilyTypeId As ElementId
) As ViewDrafting
public:
static ViewDrafting^ Create(
	Document^ document,
	ElementId^ viewFamilyTypeId
)
static member Create :
        document : Document *
        viewFamilyTypeId : ElementId -> ViewDrafting
Parameters
document Document
 The document in which the new drafting view will be created.
viewFamilyTypeId ElementId
 The id of the ViewFamilyType that should be assigned to the new drafting view.
Return Value
ViewDrafting
 The newly created drafting view.
Exceptions
Exception | Condition
ArgumentException |  viewFamilyTypeId is not a valid ViewFamilyType for a drafting view.
ArgumentNullException |  A non-optional argument was null
Example
// For simplicity, we'll look what drafting view types are already available,
// and we'll use the first one we can find to create our new drafting view.
FilteredElementCollector collector = new FilteredElementCollector(document);
collector.OfClass(typeof(ViewFamilyType));
ViewFamilyType viewFamilyType = collector.Cast<ViewFamilyType>().First(vft => vft.ViewFamily == ViewFamily.Drafting);
// Create a new ViewDrafting instance
ViewDrafting view = ViewDrafting.Create(document, viewFamilyType.Id);
view.Name = "MyViewDrafting";
// Set the CropBox
BoundingBoxXYZ boundingBox = new BoundingBoxXYZ();
boundingBox.Max = new XYZ(100, 100, 50);
boundingBox.Min = new XYZ(-100, -100, -50);
view.CropBox = boundingBox;
' For simplicity, we'll look what drafting view types are already available,
' and we'll use the first one we can find to create our new drafting view.
Dim collector As New FilteredElementCollector(document)
collector.OfClass(GetType(ViewFamilyType))
Dim viewFamilyType As ViewFamilyType = collector.Cast(Of ViewFamilyType)().First(Function(vft) vft.ViewFamily = ViewFamily.Drafting)
' Create a new ViewDrafting instance
Dim view As ViewDrafting = ViewDrafting.Create(document, viewFamilyType.Id)
view.Name = "MyViewDrafting"
' Set the CropBox
Dim boundingBox As New BoundingBoxXYZ()
boundingBox.Max = New XYZ(100, 100, 50)
boundingBox.Min = New XYZ(-100, -100, -50)
view.CropBox = boundingBox
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
ViewDrafting Class
Autodesk.Revit.DB Namespace